#### 📖 Terraform Plan ('infra/resources/prod/italynorth') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.function_to_keyvault will be created
  + resource "azurerm_role_assignment" "function_to_keyvault" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-func-01"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.function_to_storage will be created
  + resource "azurerm_role_assignment" "function_to_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-func-01"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cosmos.module.cosmos_account_wallet.azurerm_cosmosdb_account.this will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-cosmos-wallet"
        name                                     = "io-p-itn-cosmos-wallet"
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
        # (30 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.functions.module.function_wallet.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-func-01"
        name                                           = "io-p-itn-wallet-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_wallet_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }
    }

  # module.cdn.module.wallet_cdn.module.cdn_storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdn01sa"
        name                              = "iopitnwalletcdn01sa"
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
        # (39 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.functions.module.function_wallet.module.storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletfunc01st"
        name                              = "iopitnwalletfunc01st"
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
        # (39 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions.module.function_wallet.module.storage_account_durable_function[0].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletfunc01sdt"
        name                              = "iopitnwalletfunc01sdt"
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
        # (39 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.functions.azurerm_app_service_plan.app_service_plan_wallet_common,
  on ../../_modules/functions_apps/app_service_plan_wallet_common.tf line 1, in resource "azurerm_app_service_plan" "app_service_plan_wallet_common":
   1: resource "azurerm_app_service_plan" "app_service_plan_wallet_common" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.keyvault.module.key_vault_domain.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/keyvault.key_vault_domain/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
